; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
; Warehouse
;
; By: Ryan Xiao Wang, 2024
; License: MIT
;
; The aim is to move remove exactly the boxes that are marked for removal.
; Boxes start on stacks of blocks that are located on a fixed number of bases,
; and can be moved between stacks and bases. Boxes can be removed from the
; stacks and bases they are on when they are the top box.
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain warehouse)
    (:requirements :strips :typing :equality)
    (:types box base) 
    (:predicates 
        (on ?b1 - box ?b2 - box)
        (on-base ?b - box ?base - base)
        (clear ?b - box)
        (clear-base ?b - base)
        (to-remove ?b - box)
        (removed ?b - box)
    )

    (:action move
        :parameters (?b ?old-under ?new-under - box)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-to-new-base
        :parameters (?b ?old-under - box ?new-base - base)
        :precondition (and
            (clear ?b)
            (on ?b ?old-under)
            (clear-base ?new-base)
        )
        :effect (and 
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear ?old-under)
            (not (on ?b ?old-under))
        )
    )

    (:action move-from-base
        :parameters (?b - box ?base - base ?new-under - box)
        :precondition (and
            (clear ?b)
            (on-base ?b ?base)
            (clear ?new-under)
            (not (= ?new-under ?b))
        )
        :effect (and
            (on ?b ?new-under)
            (not (clear ?new-under))
            (clear-base ?base)
            (not (on-base ?b ?base))
        )
    )

    (:action move-between-base
        :parameters (?b - box ?old-base ?new-base - base)
        :precondition (and
            (clear ?b)
            (on-base ?b ?old-base)
            (clear-base ?new-base)
        )
        :effect (and
            (on-base ?b ?new-base)
            (not (clear-base ?new-base))
            (clear-base ?old-base)
            (not (on-base ?b ?old-base))
        )
    )

    (:action remove
        :parameters (?b ?under - box)
        :precondition (and
            (to-remove ?b)
            (on ?b ?under)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear ?under)
            (not (on ?b ?under))
            (not (clear ?b))
        )
    )

    (:action remove-from-base
        :parameters (?b - box ?base - base)
        :precondition (and
            (to-remove ?b)
            (on-base ?b ?base)
            (clear ?b)
        )
        :effect (and
            (removed ?b)
            (clear-base ?base)
            (not (on-base ?b ?base))
            (not (clear ?b))
        )
    )
)

; problem
;; boxes=24, remove_proportion=0.2, bases=4, instance_id=12, output=./training, seed=53

(define (problem warehouse-12)
    (:domain warehouse)
    (:objects
        box1 box2 box3 box4 box5 box6 box7 box8 box9 box10 box11 box12 box13 box14 box15 box16 box17 box18 box19 box20 box21 box22 box23 box24 - box
        base1 base2 base3 base4 - base
    )
    (:init
        (to-remove box7)
        (to-remove box15)
        (to-remove box17)
        (to-remove box20)
        (clear box23)
        (on box23 box12)
        (on box12 box4)
        (on box4 box5)
        (on box5 box10)
        (on-base box10 base1)
        (clear box19)
        (on box19 box11)
        (on box11 box16)
        (on box16 box6)
        (on box6 box17)
        (on box17 box8)
        (on box8 box14)
        (on box14 box18)
        (on-base box18 base2)
        (clear box13)
        (on box13 box21)
        (on box21 box2)
        (on box2 box24)
        (on box24 box20)
        (on box20 box9)
        (on box9 box7)
        (on-base box7 base3)
        (clear box3)
        (on box3 box22)
        (on box22 box15)
        (on box15 box1)
        (on-base box1 base4)
    )
    (:goal (and 
        (removed box7)
        (removed box15)
        (removed box17)
        (removed box20)
    ))
)

; plan
1. (move box13 box21 box23)
   deleted: (clear box23) (on box13 box21)
   added: (on box13 box23) (clear box21)
   goals met: 0 of 4
2. (move box19 box11 box13)
   deleted: (clear box13) (on box19 box11)
   added: (on box19 box13) (clear box11)
   goals met: 0 of 4
3. (move box11 box16 box19)
   deleted: (clear box19) (on box11 box16)
   added: (on box11 box19) (clear box16)
   goals met: 0 of 4
4. (move box16 box6 box11)
   deleted: (clear box11) (on box16 box6)
   added: (on box16 box11) (clear box6)
   goals met: 0 of 4
5. (move box21 box2 box16)
   deleted: (clear box16) (on box21 box2)
   added: (on box21 box16) (clear box2)
   goals met: 0 of 4
6. (move box2 box24 box21)
   deleted: (clear box21) (on box2 box24)
   added: (on box2 box21) (clear box24)
   goals met: 0 of 4
7. (move box24 box20 box2)
   deleted: (clear box2) (on box24 box20)
   added: (on box24 box2) (clear box20)
   goals met: 0 of 4
8. (remove box20 box9)
   deleted: (on box20 box9) (clear box20)
   added: (removed box20) (clear box9)
   goals met: 1 of 4
9. (move box3 box22 box24)
   deleted: (clear box24) (on box3 box22)
   added: (on box3 box24) (clear box22)
   goals met: 1 of 4
10. (move box22 box15 box3)
   deleted: (clear box3) (on box22 box15)
   added: (on box22 box3) (clear box15)
   goals met: 1 of 4
11. (remove box15 box1)
   deleted: (on box15 box1) (clear box15)
   added: (removed box15) (clear box1)
   goals met: 2 of 4
12. (move box6 box17 box1)
   deleted: (clear box1) (on box6 box17)
   added: (on box6 box1) (clear box17)
   goals met: 2 of 4
13. (remove box17 box8)
   deleted: (on box17 box8) (clear box17)
   added: (removed box17) (clear box8)
   goals met: 3 of 4
14. (move box9 box7 box22)
   deleted: (clear box22) (on box9 box7)
   added: (on box9 box22) (clear box7)
   goals met: 3 of 4
15. (remove-from-base box7 base3)
   deleted: (on-base box7 base3) (clear box7)
   added: (removed box7) (clear-base base3)
   goals met: 4 of 4
